app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
  def index
    @message = Message.all.order('created_at DESC')

INSERT INTO "messages" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @message = Message.new(message_params)

    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_message
    @message = Message.find(params[:id])